{"config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa;/home/levin/workspace/carnd/behavioural-cloning-p3/model.py\u00da\b<lambda>\u0015\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda", "batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "trainable": true, "arguments": {}, "output_shape": [80, 160, 3]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "b_regularizer": null, "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_filter": 24, "activity_regularizer": null, "name": "convolution2d_1", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_1", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "b_regularizer": null, "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_filter": 36, "activity_regularizer": null, "name": "convolution2d_2", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_2", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 5, "W_regularizer": null, "b_regularizer": null, "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_filter": 48, "activity_regularizer": null, "name": "convolution2d_3", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_3", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatialdropout2d_1", "p": 0.1, "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_filter": 64, "activity_regularizer": null, "name": "convolution2d_4", "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_4", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "nb_col": 3, "W_regularizer": null, "b_regularizer": null, "bias": true, "border_mode": "valid", "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "nb_filter": 64, "activity_regularizer": null, "name": "convolution2d_5", "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_5", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "SpatialDropout2D", "config": {"name": "spatialdropout2d_2", "p": 0.1, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 1164, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_1", "b_constraint": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_6", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 100, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_2", "b_constraint": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_7", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 50, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_3", "b_constraint": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_8", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 10, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_4", "b_constraint": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "mode": 0, "beta_regularizer": null, "name": "batchnormalization_9", "axis": -1, "trainable": true, "gamma_regularizer": null, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 1, "W_constraint": null, "activation": "linear", "activity_regularizer": null, "name": "dense_5", "b_constraint": null, "trainable": true}}], "class_name": "Sequential", "keras_version": "1.1.2"}